{
  "backend/main.mo": "Motoko backend handling access control, user profiles, contacts, birthday-range logic, and gift plans with per‑user storage.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "List of summaries describing each frontend file’s functionality.",
  "frontend/DEPLOYMENT_CHECKLIST.md": "Comprehensive checklist for validating production deployments on the Internet Computer.",
  "frontend/DEPLOYMENT.md": "Guide outlining prerequisites and steps for deploying the app to the Internet Computer.",
  "frontend/index.css": "Tailwind-based global styles defining color tokens and light/dark theme variables.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main TypeScript entry.",
  "frontend/scripts/print-live-icp0-url.sh": "Script that retrieves the frontend canister ID and prints the live icp0.io URLs.",
  "frontend/src/App.tsx": "Main React app managing authentication, profile setup, and the tabbed interface for upcoming birthdays, contacts, and gifts.",
  "frontend/src/components/ContactForm.tsx": "Form component for creating or updating contact records with validation and submission via hooks.",
  "frontend/src/components/ContactsManager.tsx": "Manages listing, searching, editing, and deleting contacts with dialogs and loading/error states.",
  "frontend/src/components/DomainSlugSuggestionsCard.tsx": "Empty file with no implemented component.",
  "frontend/src/components/GiftPlanForm.tsx": "Form for creating or editing gift plans, including contact selection, budgeting, recurrence, and validation.",
  "frontend/src/components/GiftsManager.tsx": "Manages viewing, updating, sending, editing, and deleting birthday gift plans with status handling.",
  "frontend/src/components/LoginButton.tsx": "Button that handles login/logout using Internet Identity with loading and error handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their name during initial profile setup.",
  "frontend/src/components/UpcomingDashboard.tsx": "Dashboard component that displays upcoming birthdays with filters, search, loading states, and error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useContacts.ts": "React Query hooks for listing, creating, updating, and deleting contacts via the backend actor.",
  "frontend/src/hooks/useDomainConfiguration.ts": "Empty placeholder hook file for domain configuration.",
  "frontend/src/hooks/useDomainSlugs.ts": "Empty placeholder hook file for domain slug handling.",
  "frontend/src/hooks/useGiftPlans.ts": "React Query hooks for CRUD operations on birthday gift plans using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, state management, and identity persistence through a React context provider.",
  "frontend/src/hooks/useUpcomingBirthdays.ts": "Hook to fetch upcoming birthdays for a given time window using the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for retrieving and updating the caller's user profile via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables for light and dark modes.",
  "frontend/src/lib/dateUtils.ts": "Utility functions for formatting birthdays and calculating ages and next occurrences.",
  "frontend/src/lib/domainSlug.ts": "Empty placeholder module for domain slug utilities.",
  "frontend/src/lib/time.ts": "Formats nanosecond timestamps into relative or absolute human-readable strings.",
  "frontend/src/main.tsx": "App entry point that initializes React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Provides functions to read URL parameters, persist them in sessionStorage, and clean them from hash-based routes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, shadows, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Stores project metadata including versioning, deployment status, and architectural notes."
}