{
  "backend/main.mo": "Main Motoko actor implementing authorization, user profiles, contacts, birthday range checks, and gift‑plan storage with CRUD utilities.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding empty gift‑plan maps.",
  "feature_evidence.json": "Feature evidence report mapping gift‑related UI features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file.",
  "frontend/index.css": "Tailwind base and theme variables defining light and dark color palettes and global styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React app handling authentication, profile setup, and tabs for Upcoming, Contacts, and Gifts.",
  "frontend/src/components/ContactForm.tsx": "Form component for creating and editing contacts with validation for dates, birth year, and notes.",
  "frontend/src/components/ContactsManager.tsx": "Displays, filters, creates, edits, and deletes contacts using hooks and dialog components. Handles loading, error states, and shows a searchable list of contacts.",
  "frontend/src/components/GiftPlanForm.tsx": "Form component for creating or editing gift plans tied to contacts. Validates input, submits via hooks, and supports status, budget, and notes fields.",
  "frontend/src/components/GiftsManager.tsx": "Lists, edits, deletes, and marks birthday gift plans as sent, combining contact data with plan data. Includes loading/error handling and a form modal for plan creation and editing.",
  "frontend/src/components/LoginButton.tsx": "Provides login/logout button using Internet Identity hooks and clears query cache on logout. Shows loading and authenticated states with UI icons.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their name. Validates input and submits profile data via a mutation hook.",
  "frontend/src/components/UpcomingDashboard.tsx": "Displays upcoming birthdays within a selectable time window and supports searching. Separates today’s birthdays and upcoming ones with loading/error states.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, reinitializing on identity changes. Invalidates dependent queries when the actor updates.",
  "frontend/src/hooks/useContacts.ts": "React Query hooks for listing, creating, updating, and deleting contacts using the actor API and invalidating related queries.",
  "frontend/src/hooks/useGiftPlans.ts": "Provides hooks to list and mutate birthday gift plans, calling actor methods and refreshing gift plan queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context with login, logout, identity loading, and status tracking using Dfinity AuthClient.",
  "frontend/src/hooks/useUpcomingBirthdays.ts": "Exposes a hook that fetches upcoming birthdays within a given range via the actor API.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for fetching and saving the caller’s user profile while managing query state and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/src/lib/dateUtils.ts": "Utility functions for formatting birthdays, computing ages, and determining next birthday occurrences.",
  "frontend/src/lib/time.ts": "Formats bigint timestamps into human‑readable relative or absolute date strings.",
  "frontend/src/main.tsx": "App bootstrap that sets up React Query and Internet Identity provider before rendering the main app.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and session‑stored parameters, including hash‑based query parsing.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theming (colors, radii, shadows, fonts), custom animations, and plugins.",
  "project_state.json": "Stores project metadata including features, architectural notes, issues, and the current state of a birthday reminder app with planned gift‑sending features."
}