{
  "kind": "build_request",
  "title": "Remove in-app domain name/domain configuration UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the in-app domain configuration flow so the app UI no longer prompts users to pick/apply a domain slug or displays any applied domain URL inside the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Ok so I didn’t mean for you to add the domain name in the app."
        ]
      },
      "acceptanceCriteria": [
        "The Upcoming dashboard no longer renders the DomainSlugSuggestionsCard (or any equivalent domain-setup UI).",
        "No user-facing text in the app references applying/configuring a domain, domain slugs, or shows a public URL as part of an in-app success state.",
        "Authenticated and unauthenticated user flows (login, profile setup, tabs, contacts, gifts, upcoming birthdays) continue to work without errors after removing the domain UI."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Clean up unused domain-related frontend code paths after removing the domain UI entry point (components/hooks/utilities) so the frontend builds without unused-import/lint errors and no longer makes domain-related backend calls from the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Ok so I didn’t mean for you to add the domain name in the app."
        ]
      },
      "acceptanceCriteria": [
        "Frontend compiles successfully after removing the domain UI and related imports.",
        "The app does not invoke domain-related hooks/mutations (e.g., suggestion fetching or configureDomain) during normal navigation."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Keep the backend as a single Motoko actor in backend/main.mo; only add a migration if state persistence changes require it."
  ],
  "nonGoals": [
    "Do not implement or enhance custom domain publishing behavior.",
    "Do not change Internet Identity authentication behavior.",
    "Do not redesign unrelated parts of the app (contacts, gifts, upcoming birthdays) beyond what is necessary to remove domain UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}